<?php

return [
    'lunar' => [              //可自定义节日名称
        '0000' => '除夕',
        '0101' => '春节',
        '0115' => '元宵',
        '0505' => '端午',     //端午节
        '0707' => '七夕',
        '0815' => '中秋',
        '0909' => '重阳',
        '1208' => '腊八',
    ],

    'lunar24' => [
        "小寒", "大寒", "立春", "雨水", "惊蛰", "春分", "清明", "谷雨",
        "立夏", "小满", "芒种", "夏至", "小暑", "大暑", "立秋", "处暑",
        "白露", "秋分", "寒露", "霜降", "立冬", "小雪", "大雪", "冬至"
    ],

    'special' => [
        '母亲节',  //5月第二个星期日
        '父亲节',  //6月第三个星期日
        '感恩节',  //11月第四个星期四
    ],

    'solar' => [               //可自定义节日名称，12-24平安夜
        '0101' => '元旦',
        '0214' => '情人节',
        '0308' => '妇女节',
        '0401' => '愚人节',
        '0405' => '清明节',
        '0501' => '劳动节',
        '0504' => '青年节',
        '0601' => '儿童节',
        '0801' => '建军节',
        '0910' => '教师节',
        '1001' => '国庆节',
        '1031' => '万圣节',
        '1111' => '光棍节',
        '1225' => '圣诞节',
    ],
];